SCHOOL_SUBJECTS = {

    "математика": "📐 Математика",
    "русский_язык": "📖 Русский язык", 
    "литература": "📚 Литература",
    "физика": "🔬 Физика",
    "химия": "⚗️ Химия",
    "биология": "🧬 Биология",
    "география": "🌍 География",
    "история": "🏛️ История",
    "обществознание": "⚖️ Обществознание",
    

    "английский": "🇬🇧 Английский язык",
    "немецкий": "🇩🇪 Немецкий язык",
    "французский": "🇫🇷 Французский язык",
    "китайский": "🇨🇳 Китайский язык",
    "испанский": "🇪🇸 Испанский язык",
    

    "информатика": "💻 Информатика",
    "технология": "🔧 Технология",
    

    "алгебра": "🧮 Алгебра", 
    "геометрия": "📏 Геометрия",
    

    "астрономия": "🌟 Астрономия",
    "экология": "🌱 Экология",
    

    "право": "⚖️ Право",
    "экономика": "💰 Экономика",
    "мхк": "🎭 МХК (Мировая художественная культура)",
    

    "изо": "🎨 ИЗО",
    "музыка": "🎵 Музыка",
    "черчение": "📐 Черчение",
    

    "физкультура": "🏃‍♂️ Физкультура",
    "обж": "🛡️ ОБЖ"
}


EXAM_SUBJECTS = {

    "русский_ege": "📖 Русский язык (ЕГЭ)",
    "математика_база": "📐 Математика базовая (ЕГЭ)",
    "математика_профиль": "📐 Математика профильная (ЕГЭ)",
    

    "физика_ege": "🔬 Физика (ЕГЭ)",
    "химия_ege": "⚗️ Химия (ЕГЭ)", 
    "биология_ege": "🧬 Биология (ЕГЭ)",
    "география_ege": "🌍 География (ЕГЭ)",
    "история_ege": "🏛️ История (ЕГЭ)",
    "обществознание_ege": "⚖️ Обществознание (ЕГЭ)",
    "литература_ege": "📚 Литература (ЕГЭ)",
    "информатика_ege": "💻 Информатика (ЕГЭ)",
    "английский_ege": "🇬🇧 Английский язык (ЕГЭ)",
    "немецкий_ege": "🇩🇪 Немецкий язык (ЕГЭ)",
    "французский_ege": "🇫🇷 Французский язык (ЕГЭ)",
    "испанский_ege": "🇪🇸 Испанский язык (ЕГЭ)",
    "китайский_ege": "🇨🇳 Китайский язык (ЕГЭ)",
    

    "русский_oge": "📖 Русский язык (ОГЭ)",
    "математика_oge": "📐 Математика (ОГЭ)",
    "физика_oge": "🔬 Физика (ОГЭ)",
    "химия_oge": "⚗️ Химия (ОГЭ)",
    "биология_oge": "🧬 Биология (ОГЭ)",
    "география_oge": "🌍 География (ОГЭ)",
    "история_oge": "🏛️ История (ОГЭ)",
    "обществознание_oge": "⚖️ Обществознание (ОГЭ)",
    "литература_oge": "📚 Литература (ОГЭ)",
    "информатика_oge": "💻 Информатика (ОГЭ)",
    "английский_oge": "🇬🇧 Английский язык (ОГЭ)"
}
